<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"36e17f9ea4ae22b9fc77f4a27e94a882ba430de521d02bddb919fdb5e90f19eb","plan_job_ref":"Job Terraform plan #32 at https://github.com/mkuthan/stream-processing/actions/runs/7434903328","plan_hash":"416f99db112ce606fc5c3fa90da0140fae882fe8e5163ac6073e30557ec59d4e","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-entry"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-exit"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
+   resource "google_pubsub_subscription" "vehicle-registration-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "vehicle-registration"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #32](https://github.com/mkuthan/stream-processing/actions/runs/7434903328)